{
  "title": "The Enigma of Thornbridge Hall",
  "difficulty": "medium",
  "mystery": "\nOn a gloomy November evening, the sharp ring of the telephone pierced the tobacco-laden air of 221B Baker Street. Sherlock Holmes, lounging in his favorite armchair, lazily reached for the receiver. Dr. John Watson, engrossed in the evening paper, watched as his friend's expression shifted from indifference to keen interest.\n\"Indeed, Inspector Lestrade? A locked-room mystery at Thornbridge Hall? We shall be there within the hour,\" Holmes declared, hanging up the phone with a flourish. \"Watson, it seems we have a most intriguing case on our hands. Lord Arthur Thornbridge has been found dead in his study, the door locked from the inside, with no apparent cause of death.\"\nAs their hansom cab clattered through the foggy London streets, Holmes briefed Watson on the details provided by Lestrade. Lord Thornbridge, a wealthy industrialist and patron of the sciences, had been hosting a weekend gathering of friends and colleagues at his country estate. The guests had assembled for dinner at eight o'clock, but Lord Thornbridge never appeared. After an hour of waiting, his butler, Jameson, went to check on him, only to find the study door locked. When they finally broke in, they discovered Lord Thornbridge slumped over his desk, quite dead.\nThornbridge Hall loomed before them, a grand Victorian mansion set against the backdrop of a moonlit sky. Inspector Lestrade greeted them at the door, his face etched with frustration. \"I'm glad you're here, Mr. Holmes. This one's got us all baffled.\"\nAs they entered the opulent foyer, Holmes's keen eyes darted about, taking in every detail. \"I presume the body hasn't been moved?\" he inquired.\n\"No, sir,\" Lestrade confirmed. \"Everything's just as we found it.\"\nThe study was a large, wood-paneled room lined with bookshelves and dominated by an imposing mahogany desk. Lord Thornbridge's body remained where it had been discovered, his face pressed against an open ledger. Holmes circled the room, his magnifying glass in hand, pausing occasionally to examine items of interest.\n\"Now then,\" Holmes said, straightening up, \"I should like to interview each of the guests individually. Where are they being kept?\"\nLestrade led them to the drawing room, where seven people sat in varying states of distress and impatience. Holmes observed them carefully before beginning his interrogations.\nFirst was Lady Eleanor Thornbridge, the victim's wife of thirty years. A handsome woman in her early fifties, she appeared more composed than one might expect of a newly-made widow. \"Arthur and I had a... complex relationship, Mr. Holmes,\" she admitted. \"We maintained separate bedrooms for years, but I assure you, I had no reason to wish him dead.\"\nNext came Dr. Victor Hastings, Lord Thornbridge's personal physician and old school friend. A thin, nervous man with spectacles, he fidgeted constantly during questioning. \"I last saw Arthur at tea time,\" he stated. \"He mentioned having a headache, so I gave him some powders. Purely routine, I assure you.\"\nThe third interviewee was Professor James Morley, a chemist from Oxford and Lord Thornbridge's research partner. A bear of a man with a booming voice, he spoke of their work with great enthusiasm. \"Arthur and I were on the verge of a breakthrough in our study of rare poisons and their antidotes,\" he explained. \"His death is a terrible setback for science.\"\nFollowing the professor was Miss Sophia Winters, Lord Thornbridge's young and attractive secretary. Her eyes were red from crying, and she twisted a handkerchief in her hands as she spoke. \"Lord Thornbridge was a kind employer,\" she said softly. \"He was helping me pursue my own scientific studies. I can't imagine who would want to harm him.\"\nThe fifth person Holmes interviewed was Mr. Howard Blackwood, Lord Thornbridge's solicitor. A dour man in his sixties, he seemed more annoyed than grieved. \"I was here to discuss changes to Arthur's will,\" he explained. \"He had mentioned wanting to make some adjustments, but we never got the chance to meet.\"\nNext was Captain Richard Thornbridge, the victim's younger brother. A military man with a handlebar mustache, he cut an imposing figure. \"Arthur and I had our differences,\" he admitted gruffly, \"but blood is thicker than water. I'd never harm my own brother.\"\nThe last guest to be questioned was Mrs. Lydia Fairfax, an old family friend and renowned botanist. A plump, motherly woman in her sixties, she dabbed at her eyes with a lace handkerchief. \"Poor Arthur,\" she sniffed. \"He was always so full of life. It's hard to believe he's gone.\"\nAs the interviews concluded, Holmes retreated to the study for a more thorough examination. Watson observed his friend's methodical approach, watching as he scrutinized the window latches, examined the fireplace, and pored over the contents of Lord Thornbridge's desk.\n\"Watson,\" Holmes murmured, \"what do you make of this?\" He held up a small, empty vial he had discovered hidden behind some books.\nBefore Watson could respond, they were interrupted by a commotion in the hallway. Lestrade burst in, his face flushed with excitement. \"Holmes! We've found something in the garden shed. It looks like some sort of laboratory equipment.\"\nThe shed, a short distance from the main house, was indeed set up as a makeshift laboratory. Beakers, burners, and vials of various chemicals lined crude wooden shelves. Holmes examined everything carefully, his brow furrowed in concentration.\nAs the investigation continued into the early hours of the morning, more puzzling details emerged. A groundskeeper reported seeing a figure sneaking across the lawn around the time of Lord Thornbridge's death. The cook mentioned overhearing an argument between Lord Thornbridge and an unidentified guest the previous afternoon. And a maid discovered a crumpled note in the fireplace of Lady Eleanor's bedroom, only partially burned, with the words \"...must not tell Arthur...\" still legible.\nHolmes spent hours poring over the evidence, conducting small experiments in the garden shed, and reexamining the study. As dawn broke, he gathered everyone in the drawing room, his eyes gleaming with the light of solved mystery.\n\"Ladies and gentlemen,\" he began, pacing before the fireplace, \"the death of Lord Arthur Thornbridge was indeed murder, cleverly disguised and fiendishly executed. But like all killers, this one made crucial mistakes.\"\nHe paused, building tension as he surveyed the anxious faces before him. \"The culprit is none other than Professor James Morley.\"\nGasps and murmurs filled the room as all eyes turned to the burly chemist, who had gone deathly pale.\n\"But how?\" Lady Eleanor exclaimed. \"James was Arthur's oldest friend!\"\nHolmes nodded gravely. \"A friendship that ultimately led to his downfall. You see, Lord Thornbridge and Professor Morley were indeed on the verge of a breakthrough in their research on rare poisons. However, the breakthrough was not quite what Professor Morley claimed.\"\n\"In truth, they had discovered an incredibly lethal poison that was virtually undetectable. Lord Thornbridge, realizing the danger of such a substance, decided to destroy their research and never publish their findings. But Professor Morley, seeing the potential for fame and fortune, couldn't accept this.\"\nHolmes held up the small vial he had found in the study. \"This contained the poison, which Professor Morley administered to Lord Thornbridge during their afternoon tea. The symptoms mimicked a heart attack, which is why Dr. Hastings' examination revealed nothing suspicious.\"\n\"But surely someone would have seen him enter the study,\" Captain Thornbridge interjected.\n\"Ah, but he didn't need to,\" Holmes replied. \"The poison was slow-acting, designed to take effect hours after ingestion. Professor Morley simply waited until Lord Thornbridge retreated to his study, as was his habit after tea. The locked room was merely a clever misdirection.\"\n\"However, the professor made two crucial mistakes. First, he underestimated Lord Thornbridge's tolerance to toxins, built up over years of research. This caused the poison to act more slowly than anticipated, giving Lord Thornbridge time to realize what had happened. He began writing a letter revealing the truth, which the professor later destroyed in the fireplace.\"\n\"The second mistake was returning to the garden shed to destroy evidence. In his haste, he left traces of the poison on the equipment, which I was able to identify through chemical analysis.\"\nProfessor Morley slumped in his chair, the fight gone out of him. \"He was going to ruin everything,\" he mumbled. \"Years of work, gone in an instant. I couldn't let that happen.\"\nAs Lestrade led the professor away, Holmes turned to Watson with a weary smile. \"Another case solved, my dear friend. A reminder that even in the pursuit of knowledge, the darkness of human nature can prevail.\"\nWatson nodded solemnly. \"Indeed, Holmes. It's a tragic end to a brilliant partnership.\"\nAs they prepared to leave Thornbridge Hall, Holmes paused to survey the grand old house one last time. \"You know, Watson,\" he mused, \"in all my years of detective work, I've found that the most dangerous mysteries are often those born of the intellect. For when great minds turn to darkness, the consequences can be truly devastating.\"\n",
  "suspects": [
    "Lady Eleanor Thornbridge",
    "Dr. Victor Hastings",
    "Professor James Morley",
    "Miss Sophia Winters",
    "Mr. Howard Blackwood",
    "Captain Richard Thornbridge",
    "Mrs. Lydia Fairfax"
  ],
  "culprit": "Professor James Morley",
  "reveal_index": 6478
}