{
  "title": "The Case of the Poisoned Philanthropist",
  "difficulty": "easy",
  "mystery": "\nIt was a crisp autumn morning when Dr. John Watson arrived at 221B Baker Street to find his friend, Sherlock Holmes, poring over the morning newspaper. \"Watson, my dear fellow,\" Holmes exclaimed, \"we have a most intriguing case on our hands. Lord Edward Blackwood, the renowned philanthropist, has been found dead in his study at Blackwood Manor. Inspector Lestrade has requested our assistance.\"\nWithout delay, the pair set off for the grand estate on the outskirts of London. As they approached, they observed the police constables milling about the grounds. Inspector Lestrade greeted them at the entrance, his face etched with concern.\n\"Gentlemen, I'm glad you're here,\" Lestrade began. \"Lord Blackwood was discovered this morning by his butler, slumped over his desk. The doctor confirms it was poison – cyanide, to be precise.\"\nHolmes nodded thoughtfully. \"Let us examine the scene, Lestrade. Who had access to the study last night?\"\n\"That's the peculiar thing, Mr. Holmes,\" Lestrade replied. \"Only three individuals entered the study after dinner: Lady Victoria Blackwood, the victim's wife; Mr. James Harrington, Lord Blackwood's personal secretary; and Dr. Albert Thompson, a close friend and beneficiary of Lord Blackwood's charitable work.\"\nAs they entered the study, Holmes immediately set to work, his keen eyes scanning every detail of the room. The body had been removed, but the desk remained untouched. A half-empty glass of brandy sat next to an open ledger.\n\"Tell me, Lestrade, what do we know of the events leading up to Lord Blackwood's death?\" Holmes inquired.\nLestrade consulted his notebook. \"According to the staff, Lord Blackwood retired to his study after dinner at approximately 8:30 PM. Lady Victoria visited him briefly at 9:00 PM to discuss plans for an upcoming charity gala. Mr. Harrington entered at 9:30 PM to review some financial documents. Finally, Dr. Thompson arrived unexpectedly at 10:00 PM for a nightcap, as he often did when in the area.\"\nHolmes carefully examined the brandy glass, holding it up to the light. \"Interesting. And at what time was the body discovered?\"\n\"The butler found him at 7:00 AM when he came to wake his lordship,\" Lestrade answered.\nDr. Watson, who had been examining the desk, spoke up. \"Holmes, look here. The ledger shows some rather large withdrawals over the past month.\"\nHolmes peered at the document. \"Indeed, Watson. Most curious. Lestrade, I should like to interview our three suspects. Shall we begin with Lady Victoria?\"\nLady Victoria Blackwood, a statuesque woman in her early forties, entered the study with an air of quiet dignity. \"Mr. Holmes, this is a terrible tragedy. Edward was a good man, devoted to his charitable work.\"\n\"My condolences, Lady Victoria,\" Holmes said gently. \"Might I inquire about your visit to the study last night?\"\n\"Of course,\" she replied. \"I came to discuss the upcoming gala. Edward seemed distracted, but otherwise in good spirits. I left after about ten minutes to prepare for bed.\"\nNext, they interviewed James Harrington, a nervous man with spectacles perched on his nose. \"I brought Lord Blackwood some documents to sign,\" he explained. \"He appeared agitated about something in the ledger, but didn't elaborate. I was only there for a few minutes.\"\nLastly, Dr. Albert Thompson, a jovial man with a bushy beard, recounted his visit. \"I was in the neighborhood and thought I'd pop in for a nightcap, as I often do. Edward and I shared a glass of brandy and discussed his latest charitable endeavors. He seemed perfectly fine when I left around 10:30 PM.\"\nAfter the interviews, Holmes fell into deep thought, his fingers steepled beneath his chin. Watson and Lestrade waited patiently, knowing better than to interrupt the great detective's process.\nFinally, Holmes spoke. \"The solution is clear, gentlemen. The culprit is none other than James Harrington.\"\nLestrade's eyebrows shot up in surprise. \"But how can you be certain, Mr. Holmes?\"\n\"The evidence is quite straightforward,\" Holmes explained. \"The ledger revealed unusual withdrawals, suggesting financial impropriety. Mr. Harrington, as Lord Blackwood's secretary, would have had intimate knowledge of the accounts. When confronted by his employer, he panicked and resorted to murder to conceal his embezzlement.\"\n\"But the brandy was poisoned,\" Watson interjected. \"Surely Dr. Thompson is the more likely suspect, given that he shared a drink with the victim.\"\nHolmes shook his head. \"Ah, but that's where the timing is crucial, my dear Watson. The cyanide was not in the brandy itself, but rather applied to the rim of the glass. It would have taken effect almost immediately. Lord Blackwood was found dead hours after Dr. Thompson left, meaning the poison was administered earlier.\"\n\"Mr. Harrington's nervousness and vague account of his visit betray his guilt,\" Holmes continued. \"I suspect if we search his quarters, we'll find the remainder of the cyanide and evidence of his theft.\"\nLestrade nodded, impressed. \"Brilliant as always, Mr. Holmes. I'll have my men conduct a search immediately.\"\nAs predicted, a search of James Harrington's rooms uncovered damning evidence, and he soon confessed to the crime. The case of the poisoned philanthropist was solved, another testament to Sherlock Holmes' unparalleled deductive skills.",
  "suspects": [
    "Lady Victoria Blackwood",
    "James Harrington",
    "Dr. Albert Thompson"
  ],
  "culprit": "James Harrington",
  "reveal_index": 3853
}