{
  "title": "The Case of the Silenced Soprano",
  "difficulty": "easy",
  "mystery": "\nIt was a crisp autumn evening when Inspector Lestrade burst into 221B Baker Street, his face flushed with urgency. \"Holmes! We need your help at the Royal Opera House. There's been a murder!\"\nSherlock Holmes, ever composed, raised an eyebrow. \"Indeed? Do tell, Lestrade.\"\nAs we made our way to the opera house, Lestrade filled us in on the grim details. The victim was Madame Eloise Bellamy, the lead soprano in the current production of \"La Traviata.\" She had been found dead in her dressing room, strangled with her own silk scarf, mere hours before the evening's performance.\nUpon arrival, we were led to the victim's dressing room. The space was lavish, befitting a star of Madame Bellamy's caliber. Her lifeless body lay sprawled across a chaise lounge, the silk scarf still wound tightly around her neck.\nHolmes circled the room, his keen eyes taking in every detail. He paused at the dressing table, examining the various cosmetics and personal items strewn about. \"Tell me, Lestrade, who discovered the body?\"\n\"That would be Mr. Thomas Greene, the stage manager,\" Lestrade replied. \"He came to call Madame Bellamy for her final costume fitting and found her like this.\"\nHolmes nodded, his fingers tracing the edge of a shattered mirror on the dressing table. \"And our suspects?\"\nLestrade consulted his notebook. \"We have three primary suspects. First, there's Mr. Greene himself. Despite his claim of discovering the body, he had means and opportunity. Then we have Miss Lucinda Fairfax, Madame Bellamy's understudy. She stands to gain the most from Eloise's death, as she'll now take the lead role. Lastly, there's Mr. Victor Rosaline, Madame Bellamy's former lover and the opera's lead tenor.\"\nAs Lestrade spoke, Holmes examined the room further, paying particular attention to a half-empty glass of water on the side table and a small pile of sheet music near the victim's hand.\n\"Let's speak with our suspects, shall we?\" Holmes suggested.\nWe began with Thomas Greene, a nervous man in his fifties with thinning hair and spectacles. \"I swear, I had nothing to do with this,\" he stammered. \"I was in my office all afternoon, preparing for tonight's performance. I only left to fetch Madame Bellamy for her fitting.\"\nNext came Lucinda Fairfax, a young woman with fiery red hair and ambitious eyes. \"It's terrible what happened to Eloise,\" she said, her voice tinged with what seemed like genuine sorrow. \"Yes, I'm her understudy, but I would never... I was practicing my scales in the rehearsal room all afternoon. Several chorus members can vouch for me.\"\nLastly, we interviewed Victor Rosaline, a handsome man with a proud bearing. \"Eloise and I may have had our differences, but I respected her immensely as an artist,\" he declared. \"I was in my dressing room, going over my lines. My valet can confirm this.\"\nAs we concluded our interviews, Holmes turned to me with a glimmer in his eye. \"Well, Watson, what do you make of it?\"\nI shook my head, bewildered. \"I'm afraid I'm at a loss, Holmes. They all seem to have alibis, yet they all had motive and opportunity.\"\nHolmes smiled. \"Ah, but the devil is in the details, my dear Watson. Lestrade, I believe I can shed light on this tragic affair.\"\nWe gathered in Madame Bellamy's dressing room once more, the suspects looking on nervously as Holmes paced the floor.\n\"This case, while tragic, is not as complex as it may seem,\" Holmes began. \"The culprit is none other than Mr. Thomas Greene.\"\nGasps filled the room as Greene's face turned ashen. Holmes continued, \"Mr. Greene's guilt is evident in several key details. First, the shattered mirror on the dressing table. It was broken not in a struggle, but deliberately to remove evidence - specifically, fingerprints. This suggests the culprit was someone familiar with police procedures.\n\"Secondly, the half-empty glass of water. Madame Bellamy was known to drink tea before performances to soothe her throat, yet here we find water. This indicates the drink was brought by someone else - someone who didn't know her habits.\n\"Lastly, and most tellingly, is the sheet music near the victim's hand. It's from Act III of 'La Traviata,' but Madame Bellamy, as a consummate professional, would have been rehearsing Act I, which opens the show. Only someone unfamiliar with the opera's progression would make such a mistake in staging the scene.\n\"Mr. Greene, as stage manager, had the access and opportunity to commit this crime. His nervousness wasn't due to the shock of discovery, but the fear of being caught. His claim of being in his office all afternoon was a lie - he had no witnesses to corroborate his story, unlike our other suspects.\"\nAs Lestrade moved to arrest the now-confessing Greene, Holmes turned to me. \"A sad affair, Watson, driven by jealousy and resentment. It seems Mr. Greene had proposed marriage to Madame Bellamy and was spurned. He couldn't bear to see her perform night after night, a constant reminder of his rejection.\"\nWith the case solved, we left the opera house, the echo of tragedy lingering in the air. Another mystery unraveled, another criminal brought to justice by the incomparable Sherlock Holmes.\n",
  "suspects": [
    "Thomas Greene",
    "Lucinda Fairfax",
    "Victor Rosaline"
  ],
  "culprit": "Thomas Greene",
  "reveal_index": 3432
}